FranciszekJanicki/stm32_cubemx_atlas_joint/cubemx/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DRV8825_EN_Pin GPIO_PIN_13
#define DRV8825_EN_GPIO_Port GPIOC
#define JOINT_DELTA_Pin GPIO_PIN_2
#define JOINT_DELTA_GPIO_Port GPIOA
#define JOINT_DELTA_EXTI_IRQn EXTI2_IRQn
#define JOINT_DRDY_Pin GPIO_PIN_3
#define JOINT_DRDY_GPIO_Port GPIOA
#define DRV885_DIR_Pin GPIO_PIN_15
#define DRV885_DIR_GPIO_Port GPIOA
#define DRV8825_STEP_Pin GPIO_PIN_3
#define DRV8825_STEP_GPIO_Port GPIOB
#define DRV8825_M2_Pin GPIO_PIN_4
#define DRV8825_M2_GPIO_Port GPIOB
#define DRV8825_M1_Pin GPIO_PIN_5
#define DRV8825_M1_GPIO_Port GPIOB
#define DRV8825_M0_Pin GPIO_PIN_6
#define DRV8825_M0_GPIO_Port GPIOB
#define AS5600_DIR_Pin GPIO_PIN_7
#define AS5600_DIR_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
